In [2]:
people = {
    "First": ["pooja", 'gaurav', 'purv'], 
    "Last": ["patil", 'mahajan', 'mahajan'], 
    "email": ["pooja123@gmail.com", 'gaurr123@email.com', 'purv143@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

    First     Last               email
0   pooja    patil  pooja123@gmail.com
1  gaurav  mahajan  gaurr123@email.com
2    purv  mahajan   purv143@email.com

# #Add columns

In [6]:
df['First'] +' ' + df['Last']

0       pooja patil
1    gaurav mahajan
2      purv mahajan
dtype: object

In [7]:
df['Full_Name'] = df['First'] +' ' + df['Last']

In [8]:
df['Full_Name']

0       pooja patil
1    gaurav mahajan
2      purv mahajan
Name: Full_Name, dtype: object

In [9]:
df

    First     Last               email       Full_Name
0   pooja    patil  pooja123@gmail.com     pooja patil
1  gaurav  mahajan  gaurr123@email.com  gaurav mahajan
2    purv  mahajan   purv143@email.com    purv mahajan

# Remove Columns

In [10]:
df.drop(columns = ['First' , 'Last'])

                email       Full_Name
0  pooja123@gmail.com     pooja patil
1  gaurr123@email.com  gaurav mahajan
2   purv143@email.com    purv mahajan

In [11]:
df

    First     Last               email       Full_Name
0   pooja    patil  pooja123@gmail.com     pooja patil
1  gaurav  mahajan  gaurr123@email.com  gaurav mahajan
2    purv  mahajan   purv143@email.com    purv mahajan

In [12]:
df.drop(columns = ['First' , 'Last'] , inplace = True)

In [13]:
df

                email       Full_Name
0  pooja123@gmail.com     pooja patil
1  gaurr123@email.com  gaurav mahajan
2   purv143@email.com    purv mahajan

# split columns

In [14]:
df['Full_Name'].str.split(' ')

0       [pooja, patil]
1    [gaurav, mahajan]
2      [purv, mahajan]
Name: Full_Name, dtype: object

In [15]:
df['Full_Name'].str.split(' ',expand = True)

        0        1
0   pooja    patil
1  gaurav  mahajan
2    purv  mahajan

In [16]:
df[['First','Last']] = df['Full_Name'].str.split(' ',expand = True)

In [17]:
df

                email       Full_Name   First     Last
0  pooja123@gmail.com     pooja patil   pooja    patil
1  gaurr123@email.com  gaurav mahajan  gaurav  mahajan
2   purv143@email.com    purv mahajan    purv  mahajan

# #Add Row

In [20]:
df.append({'First' : 'Swarit'},ignore_index= True)

                email       Full_Name   First     Last
0  pooja123@gmail.com     pooja patil   pooja    patil
1  gaurr123@email.com  gaurav mahajan  gaurav  mahajan
2   purv143@email.com    purv mahajan    purv  mahajan
3                 NaN             NaN  Swarit      NaN

# Append two Dataframes

In [21]:
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [22]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [23]:

df = df.append(df2, ignore_index=True, sort=False)

In [24]:
df

                email       Full_Name   First     Last  first    last
0  pooja123@gmail.com     pooja patil   pooja    patil    NaN     NaN
1  gaurr123@email.com  gaurav mahajan  gaurav  mahajan    NaN     NaN
2   purv143@email.com    purv mahajan    purv  mahajan    NaN     NaN
3  IronMan@avenge.com             NaN     NaN      NaN   Tony   Stark
4      Cap@avenge.com             NaN     NaN      NaN  Steve  Rogers

# Remove Rows

In [27]:
df.drop(index = 4)

                email       Full_Name   First     Last first   last
0  pooja123@gmail.com     pooja patil   pooja    patil   NaN    NaN
1  gaurr123@email.com  gaurav mahajan  gaurav  mahajan   NaN    NaN
2   purv143@email.com    purv mahajan    purv  mahajan   NaN    NaN
3  IronMan@avenge.com             NaN     NaN      NaN  Tony  Stark

In [26]:
filt = df['Last'] == 'mahajan'
df.drop(index=df[filt].index)

                email    Full_Name  First   Last  first    last
0  pooja123@gmail.com  pooja patil  pooja  patil    NaN     NaN
3  IronMan@avenge.com          NaN    NaN    NaN   Tony   Stark
4      Cap@avenge.com          NaN    NaN    NaN  Steve  Rogers